tap "anomalyco/tap"
tap "heroku/brew"
tap "homebrew/services"
tap "microsoft/git"
tap "supabase/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Emacs dependency management
brew "cask"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Manage your Java environment
brew "jenv"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# QR Code generation
brew "qrencode"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command driven spotify player
brew "spotify_player"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line task management
brew "task"
# Terminal user interface for Taskwarrior
brew "taskwarrior-tui"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Supabase CLI
brew "supabase/tap/supabase"
# Command-line interface for 1Password
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source image editor
cask "gimp"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# Emoji picker optimised for blind people
cask "rocket"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "aaron-bond.better-comments"
vscode "adelphes.android-dev-ext"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "anysphere.remote-ssh"
vscode "bilalekrem.scenebuilderextension"
vscode "bysabi.prettier-vscode-standard"
vscode "dakshmiglani.hex-to-rgba"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "hars.cppsnippets"
vscode "hdoro.sanity-snippets"
vscode "humao.rest-client"
vscode "icrawl.discord-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "motion.motion-vscode-extension"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mxsdev.typescript-explorer"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rluvaton.vscode-vitest"
vscode "sanity-io.vscode-sanity"
vscode "shrey150.javafx-support"
vscode "streetsidesoftware.code-spell-checker"
vscode "typefox.open-collaboration-tools"
vscode "vitest.explorer"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.wallaby-vscode"
vscode "wscats.html-snippets"
